{
    "1": {
        "style": "tweet",
        "example": "# AITA for REFUSING to Share My Gaming Console? :video_game:\n## The AUDACITY of My Roommate! :triumph:\nSo get this fam - my roommate has the NERVE to demand I share my brand new PS5 that I saved up for MONTHS to buy! Like, who does she think she is?? :thinking_face:\nShe keeps saying \"we should split everything as roommates\" but did she split the cost?? ABSOLUTELY NOT! And now she's giving me the silent treatment because I said no...\nCan you BELIEVE the entitlement? What would YOU do in this situation? Am I being unreasonable for wanting to keep MY property to MYSELF?\n#RoommateProblems #AITA #GamerLife #TheAudacity"
    },
    "2": {
        "style": "old timey radio",
        "examples": [
            "The poster describes their experience with the VHS version of \"They All Laughed,\" a film they purchased due to the intriguing cast members, including Peter Bogdanovich, Audrey Hepburn, John Ritter, and Dorothy Stratten. They also considered positive reviews from the \"Mick Martin & Marsha Porter Video & DVD Guide 2003.\" After watching the movie, they found it to be disappointing. They noted that the characters were poorly developed, making it difficult to follow the plot, which they expected to be funny but found unamusing. The coincidences in the story seemed unrealistic, particularly in the context of New York City. While they appreciated the presence of certain actors, such as Ben Gazarra, Dorothy Stratten, Patti Hansen, and Audrey Hepburn, they did not enjoy the film overall.\nDespite their reservations, they plan to keep the movie in their collection primarily for the notable cast members, especially Dorothy Stratten, who tragically died shortly after the film's release. The poster concludes with a rating of four out of ten. The title in Portuguese is \"Muito Riso e Muita Alegria,\" which translates to \"Many Laughs and Lots of Happiness.\"",
            "[Dim ambient music playing softly in the background, the sound of crackling static fills the air before fading into a warm, inviting tone]\nLadies and gentlemen, gather 'round, dear listeners. Tonight, we bring you a tale from the shadows of forgotten movies, a story that whispers through the ages. A tale of laughter and tears, of love and loss, all captured on the fragile tape of a VHS, found in the dusty corners of time.\nIt was a night much like any other, when our intrepid listener stumbled upon a gem of the past, hidden among the relics of a bygone era. A VHS, weathered and worn, with a cover that hinted at treasures long buried. Names danced across the screen: Peter Bogdanovich, Audrey Hepburn, John Ritter, and the name that sent chills down the spine—Dorothy Stratten.\nThe listener, armed with nothing but curiosity and a bargain price, plucked the tape from the shelf, as if plucking a secret from the hands of fate itself. With a flick of a switch, the screen flickered to life, revealing a world that was both familiar and strange.\nAs the film unfurled, the atmosphere shifted. What was promised as a tapestry of laughter became a canvas of confusion. Characters, painted in the hues of the past, seemed to dance in a blur, their roles as elusive as the morning mist."
        ]
    },
    "3": {
        "style": "inquisitive",
        "example": "Copyright law governs how creative works can be used and shared. It provides a legal framework for protecting intellectual property rights and controlling how content is distributed. Creative Commons was established as an organization to provide standardized licenses that creators can use to share their work.\nThese licenses allow creators to specify exactly how they want their work to be used by others. Some creators choose to share their work openly with few restrictions, enabling broad reuse and adaptation. Others maintain stricter control over their intellectual property, limiting how it can be used or requiring specific attribution.\nThe system of copyright and Creative Commons licensing provides structure around content sharing and reuse in our modern digital world. This helps balance the rights of creators with the benefits of open knowledge sharing."
    }
}